# Tapşırıq 1.

## Üç və daha çox məhsul alan müştərilərin neçə faizi alış veriş zamanı bonus kartdan istifadə edib?

In [1]:
# pandası daxil edirik

import pandas as pd

In [2]:
data = pd.read_csv("esas_mehsullar.csv").copy()
data.head()

,column_a,satish_kodu,mehsul_kodu,mehsul_ad,mehsul_kateqoriya,mehsul_qiymet,satish_tarixi,endirim_kompaniya,bonus_kart,magaza_ad,magaza_lat,magaza_long,magaza_location
0,0,577571,3334,GONDOL SIMPLE LABABO VE BUZLUK HALISI G61*50,Məişət məhsulları,3.68,2019-07-19T12:29:00,Sərin Yay günləri,True,Zabrat,40.485561,49.946741,POINT(49.9467409 40.4855613)
1,1,577571,4674,TAXTA BICAQ 3232,Qab-qacaq,2.25,2019-07-19T12:29:00,Sərin Yay günləri,True,Zabrat,40.485561,49.946741,POINT(49.9467409 40.4855613)
2,2,577571,8388,VITA 1LT ANANAS SIRESI,Meyvə Şirələri,2.50,2019-07-19T12:29:00,Sərin Yay günləri,True,Zabrat,40.485561,49.946741,POINT(49.9467409 40.4855613)
3,3,577571,6017,GILAN BAGDAN 1LT SARI GAVALI KOMPOTU,Kompotlar,1.45,2019-07-19T12:29:00,Sərin Yay günləri,True,Zabrat,40.485561,49.946741,POINT(49.9467409 40.4855613)
4,4,577571,8297,OSRAM SUPERSTAR LAMPA 64544A ECO 57W E27,Məişət məhsulları,2.92,2019-07-19T12:29:00,Sərin Yay günləri,True,Zabrat,40.485561,49.946741,POINT(49.9467409 40.4855613)

In [3]:
# bizə lazım olan dəyişənləri seçirik

data = data[["satish_kodu", "bonus_kart"]].copy()
data.head()

   satish_kodu  bonus_kart
0       577571        True
1       577571        True
2       577571        True
3       577571        True
4       577571        True

In [4]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 438826 entries, 0 to 438825
Data columns (total 2 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   satish_kodu  438826 non-null  int64
 1   bonus_kart   438826 non-null  bool
dtypes: bool(1), int64(1)
memory usage: 3.8 MB

In [5]:
data.isnull().sum()

satish_kodu    0
bonus_kart     0
dtype: int64

In [6]:
data["satish_kodu"] = data["satish_kodu"].astype("object")

In [7]:
data.head()

  satish_kodu  bonus_kart
0      577571        True
1      577571        True
2      577571        True
3      577571        True
4      577571        True

In [8]:
# üç və daha çox məhsul alanları filter edirik

df = data.groupby("satish_kodu")["satish_kodu"].count() >= 3

In [9]:
df

satish_kodu
222224     True
222229     True
222245     True
222256    False
222258     True
          ...
999935     True
999958     True
999971     True
999973     True
999984     True
Name: satish_kodu, Length: 80000, dtype: bool

In [10]:
# yalnız True olanları filter edirik

ucden_boyuk = df[df]
ucden_boyuk

satish_kodu
222224    True
222229    True
222245    True
222258    True
222263    True
          ...
999935    True
999958    True
999971    True
999973    True
999984    True
Name: satish_kodu, Length: 70016, dtype: bool

In [11]:
# True olan satış kodlarından yeni dataframe yaradırıq 

df = pd.DataFrame(ucden_boyuk.index)

In [12]:
df

       satish_kodu
0           222224
1           222229
2           222245
3           222258
4           222263
...            ...
70011       999935
70012       999958
70013       999971
70014       999973
70015       999984

[70016 rows x 1 columns]

In [13]:
# satış kodlarına görə bonus kartlarını qruplayırıq

bonus = data.groupby("satish_kodu")["bonus_kart"].mean()

In [14]:
# satış kodları ilə bonus kartlarını birləşdiririk

last_data = pd.merge(df,bonus,on="satish_kodu")

In [15]:
last_data

       satish_kodu  bonus_kart
0           222224       False
1           222229        True
2           222245        True
3           222258        True
4           222263        True
...            ...         ...
70011       999935       False
70012       999958        True
70013       999971        True
70014       999973       False
70015       999984        True

[70016 rows x 2 columns]

In [16]:
last_data[last_data["bonus_kart"] == True]

       satish_kodu  bonus_kart
1           222229        True
2           222245        True
3           222258        True
4           222263        True
6           222274        True
...            ...         ...
70008       999853        True
70010       999912        True
70012       999958        True
70013       999971        True
70015       999984        True

[34867 rows x 2 columns]

In [17]:
# bonus_kart True olanların ümumi bonus kart sayına nisbətini tapırıq

print("Nəticə = %.2f" % ((34867 * 100) / 70016), "%")

Nəticə = 49.80 %